In [18]:
import pandas as pd

In [19]:
data = {'Nombre': ['Ana', 'Luis', 'Carlos', 'Sara'],
        'Edad': [25,30,22,27],
        'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Bilbao']}

df = pd.DataFrame(data)
df

   Nombre  Edad     Ciudad
0     Ana    25     Madrid
1    Luis    30  Barcelona
2  Carlos    22   Valencia
3    Sara    27     Bilbao

In [20]:
df['Salario'] = [30000,45000,38000,32000]
df

   Nombre  Edad     Ciudad  Salario
0     Ana    25     Madrid    30000
1    Luis    30  Barcelona    45000
2  Carlos    22   Valencia    38000
3    Sara    27     Bilbao    32000

In [21]:
df['Salario'] = df['Salario'] + 3000
df

   Nombre  Edad     Ciudad  Salario
0     Ana    25     Madrid    33000
1    Luis    30  Barcelona    48000
2  Carlos    22   Valencia    41000
3    Sara    27     Bilbao    35000

In [22]:
nombres = df['Nombre']
nombres

0       Ana
1      Luis
2    Carlos
3      Sara
Name: Nombre, dtype: object

In [23]:
rucos = df[df['Edad'] > 25]
rucos

  Nombre  Edad     Ciudad  Salario
1   Luis    30  Barcelona    48000
3   Sara    27     Bilbao    35000